Revit 2027 API
FileExportingEventArgs.Path Property
 The target path for the export.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Path { get; }
Public ReadOnly Property Path As String
	Get
public:
property String^ Path {
	String^ get ();
}
member Path : string with get
Property Value
String
Remarks
 When several files are exported at the same time, 'Path' property will just report the directory instead of those full file names.
See Also
Reference
FileExportingEventArgs Class
Autodesk.Revit.DB.Events Namespace